esraessfib/-Multi-Node-STM32-CAN-Network-with-ESP32-MQTT-Bridge-Node-RED-Dashboard/I2C_NODE.c
/*
Quand le n�ud central envoie une requ�te CAN (ID 0x550), le STM32 :
    - Re�oit la requ�te (interruption CAN)
    - Lit la temp�rature du DS1621
    - Envoie la r�ponse via CAN (ID 0x681)
*/

/*
 ******************************************************************************
  * DS1621 Connection to I2C1:
  * - SDA to PB7
  * - SCL to PB6
  * - VDD to 3.3V
  * - GND to GND
  * - A0, A1, A2 to GND (address 0x48)
  * 
  * CAN1 Connection:
  * - CAN_RX to PB8
  * - CAN_TX to PB9
  * 
  * USART3 (Debug):
  * - PD8 = TX
  * - PD9 = RX
  ******************************************************************************
  */

#include "stm32f4xx.h"
#include "stm32f4xx_can.h"
#include <stdint.h>
#include <stdio.h>

/* ================== DS1621 Definitions ================== */
#define DS1621_WRITE_ADDR          0x90
#define DS1621_READ_ADDR           0x91
#define DS1621_START_CONVERSION    0xEE
#define DS1621_READ_TEMP           0xAA
#define DS1621_ACCESS_CONFIG       0xAC
#define DS1621_ADDR                0x48

/* ================== CAN Definitions ================== */
#define CAN_ID_TEMP_REQUEST   0x550  // ID pour recevoir la requ�te
#define CAN_ID_TEMP_RESPONSE  0x681  // ID pour envoyer la r�ponse

/* ================== Global Variables ================== */
float current_temperature = 0.0f;
int bol=0;
/* ================== Function Prototypes ================== */
//void hse_clk(void);
void SystemClock_Config(void);
void GPIO_Config(void);
void config_I2C1(void);
void CAN_Config(void);
void USART3_init(void);
void USART3_send_string(char* str);
void delay_ms(uint32_t ms);

void DS1621_Init(void);
void I2C_COMMAND(int command);
void Start_DS1621_Conv(void);
float I2C_ReadTemperature(void);

void CAN_Send_Temperature(float temp);


/* ================== Function to enable the High-Speed External (HSE) clock ================== */

void SystemClock_Config(void)
{
    // 1. Enable HSE 
    RCC->CR |= 0x00010000;              // HSEON
    while (!(RCC->CR & 0x00020000));    // HSERDY

    // 2. Enable Power interface clock 
    RCC->APB1ENR |= 0x10000000;          // PWREN

    // 3. Voltage regulator Scale 1 
    PWR->CR |= 0x00004000;               // VOS = Scale 1

    // 4. Flash configuration
     //  - 5 wait states
       //- ICEN | DCEN | PRFTEN
    
    FLASH->ACR = 0x00000705;
    //
      // LATENCY = 5WS  -> bits [2:0] = 101
      // PRFTEN         -> bit 8
      // ICEN           -> bit 9
     //  DCEN           -> bit 10
   

    // 5. PLL configuration
      // PLLM = 4
       //PLLN = 168
       //PLLP = 2
       //PLLSRC = HSE
       //PLLQ = 4
    
    RCC->PLLCFGR = 0x07402A04;
    //
      // PLLM  = 4      -> bits [5:0]
       //PLLN  = 168    -> bits [14:6]
       //PLLP  = 2      -> bits [17:16] = 00
       //PLLSRC = HSE   -> bit 22
       //PLLQ  = 4      -> bits [27:24]
    

    // 6. Enable PLL 
    RCC->CR |= 0x01000000;               // PLLON
    while (!(RCC->CR & 0x02000000));     // PLLRDY

    // 7. Prescalers
      // AHB  = SYSCLK /1
       //APB1 = HCLK /4
       //APB2 = HCLK /2
    
    RCC->CFGR |= 0x00009400;
    
    //   HPRE  = 1   -> 0000
      // PPRE1 = /4  -> 101
      // PPRE2 = /2  -> 100
    

    // 8. Select PLL as system clock 
    RCC->CFGR &= ~0x00000003;            // Clear SW bits
    RCC->CFGR |= 0x00000002;             // SW = PLL

    while ((RCC->CFGR & 0x0000000C) != 0x00000008); // SWS = PLL
}




 /* ================== Configuration des GPIO pour CAN et LED   ================== */

void GPIO_Config(void)
{
    /* Enable clocks */
    RCC->AHB1ENR |= RCC_AHB1ENR_GPIOBEN | RCC_AHB1ENR_GPIODEN;
    
    /* CAN1 - PB8(RX), PB9(TX) */
    GPIOB->MODER &= ~((3U << 16) | (3U << 18));
    GPIOB->MODER |=  ((2U << 16) | (2U << 18));  // AF mode
    GPIOB->OSPEEDR |= ((3U << 16) | (3U << 18)); // Very high speed
    GPIOB->OTYPER &= ~((1U << 8) | (1U << 9));   // Push-pull
    GPIOB->PUPDR &= ~((3U << 16) | (3U << 18));  // No pull-up
    GPIOB->AFR[1] &= ~((0xF << 0) | (0xF << 4));
    GPIOB->AFR[1] |=  ((9U << 0) | (9U << 4));   // AF9 = CAN1
    
    /* LEDs - PD12(Green), PD13(Orange), PD14(Red) */
    GPIOD->MODER &= ~((3U << 24) | (3U << 26) | (3U << 28));
    GPIOD->MODER |=  ((1U << 24) | (1U << 26) | (1U << 28));  // Output
    GPIOD->OSPEEDR |= ((2U << 24) | (2U << 26) | (2U << 28)); // Medium speed
    GPIOD->ODR &= ~((1 << 12) | (1 << 13) | (1 << 14));       // All off
}


/* ================== Configuration I2C1 pour DS1621 ================== */
  
void config_I2C1(void)
{
    // Configuration GPIO pour I2C1
    RCC->AHB1ENR |= RCC_AHB1ENR_GPIOBEN;  
    GPIOB->OTYPER |= GPIO_OTYPER_OT6 | GPIO_OTYPER_OT7;  
    GPIOB->MODER |= GPIO_MODER_MODER6_1 | GPIO_MODER_MODER7_1; 
    GPIOB->AFR[0] |= GPIO_AFRL_AFRL6_2 | GPIO_AFRL_AFRL7_2;  

    RCC->APB1ENR |= RCC_APB1ENR_I2C1EN; 
    // Configure I2C1 for 100 kHz	
    I2C1->CCR &= ~I2C_CCR_FS;  
    I2C1->CR2 = 42;  // APB1 = 42 MHz frequency in MHz
    I2C1->CCR = 210; // 42MHz / (2 * 100kHz) = 210
    I2C1->TRISE = 43;  // (1000ns / 23.8ns) + 1 = 43
    I2C1->CR1 |= I2C_CR1_PE; 
}


/* ================== Configuration de CAN1 ================== */

void CAN_Config(void)
{
    CAN_InitTypeDef CAN_InitStruct; // cet instant, on a creer en memoire la variable CAN_InitStruct contenant des valeurs al?atoiresde de type CAN_InitTypeDef  qui est une  structure (declare ds can.h )  
    CAN_FilterInitTypeDef CAN_FilterStruct;
    
    /* Activation horloge CAN1 */
    RCC->APB1ENR |= RCC_APB1ENR_CAN1EN;
	
	  /* Reset CAN1 */
    RCC->APB1RSTR |= RCC_APB1RSTR_CAN1RST;
    RCC->APB1RSTR &= ~RCC_APB1RSTR_CAN1RST;
    delay_ms(10);
    
    /* Configuration CAN */
    CAN_InitStruct.CAN_TTCM = DISABLE;
    CAN_InitStruct.CAN_ABOM = ENABLE;   // Automatic Bus-Off Management
    CAN_InitStruct.CAN_AWUM = DISABLE;
    CAN_InitStruct.CAN_NART = DISABLE;  // Automatic Retransmission
    CAN_InitStruct.CAN_RFLM = DISABLE;
    CAN_InitStruct.CAN_TXFP = DISABLE;
    CAN_InitStruct.CAN_Mode = CAN_Mode_Normal;
    CAN_InitStruct.CAN_SJW = CAN_SJW_1tq; // Synchronization jump width  SJW = 1 TQ
    CAN_InitStruct.CAN_BS1 = CAN_BS1_10tq;
    CAN_InitStruct.CAN_BS2 = CAN_BS2_5tq;
    CAN_InitStruct.CAN_Prescaler = 2;
    
    /* Initialisation CAN */
    if(CAN_Init(CAN1, &CAN_InitStruct) != CAN_InitStatus_Success)
    {
        /* Erreur d'initialisation - allumer LED rouge */
			  
        GPIOD->ODR |= (1 << 14);  // LED rouge PD14
			  USART3_send_string("CAN1 Init Failed!\r\n");
        while(1);
    }
		else
    {
        USART3_send_string("CAN1 Initialized OK\r\n");
    }
    
    /* Configuration du filtre pour recevoir les requ�tes */
    CAN_FilterStruct.CAN_FilterNumber = 18; // Filter number
    CAN_FilterStruct.CAN_FilterMode = CAN_FilterMode_IdMask;
    CAN_FilterStruct.CAN_FilterScale = CAN_FilterScale_32bit;
    CAN_FilterStruct.CAN_FilterIdHigh = (CAN_ID_TEMP_REQUEST << 5) ;
    CAN_FilterStruct.CAN_FilterIdLow = 0;
    CAN_FilterStruct.CAN_FilterMaskIdHigh =(0x7FF << 5);  // Masque pour ID exact
    CAN_FilterStruct.CAN_FilterMaskIdLow = 0;
    CAN_FilterStruct.CAN_FilterFIFOAssignment = CAN_Filter_FIFO0;
    CAN_FilterStruct.CAN_FilterActivation = ENABLE;
    CAN_SlaveStartBank(20);
    CAN_FilterInit(&CAN_FilterStruct);
    

		USART3_send_string("CAN1 Filter and Interrupts Configured\r\n");
}

/* ================== Configuration USART3 pour debug ================== */
void USART3_init(void)
{
    // Enable clocks
    RCC->AHB1ENR |= RCC_AHB1ENR_GPIODEN;
    RCC->APB1ENR |= RCC_APB1ENR_USART3EN;
    
    // Configure PD8 (TX) and PD9 (RX) for USART3
    GPIOD->MODER &= ~((3 << (8*2)) | (3 << (9*2)));
    GPIOD->MODER |=  ((2 << (8*2)) | (2 << (9*2)));  // AF mode
    
    // Push-pull output type
    GPIOD->OTYPER &= ~((1 << 8) | (1 << 9));
    
    // High speed
    GPIOD->OSPEEDR |= ((3 << (8*2)) | (3 << (9*2)));
    
    // No pull-up/pull-down
    GPIOD->PUPDR &= ~((3 << (8*2)) | (3 << (9*2)));

    // AF7 for USART3
    GPIOD->AFR[1] &= ~((0xF << 0) | (0xF << 4));
    GPIOD->AFR[1] |=  ((7 << 0) | (7 << 4));
    
    // Configure USART3: 115200 bps @ APB1 = 42 MHz
    // BRR = 42000000 / 115200 = 364.58 � 364 (0x16C)
    USART3->BRR = 364;
    
    // Enable TX, RX and USART
    USART3->CR1 = USART_CR1_TE | USART_CR1_RE | USART_CR1_UE;
    
    // Petit d�lai pour stabilisation
    delay_ms(10);
}

/* ================== Envoi d'une cha�ne via USART2 ================== */
void USART3_send_string(char* str)
{
    while(*str) {
        while(!(USART3->SR & USART_SR_TXE));
        USART3->DR = *str++;
    }
}

/* ================== D�lai en millisecondes ================== */
void delay_ms(uint32_t ms)
{
	  /* Approximation: 168 MHz / 4 cycles per loop = 42M loops/sec */
    volatile uint32_t i;
    for(i = 0; i < ms * 42000; i++) { }
}

/* ========== DS1621 Functions ========== */

/**
  *   Initialisation du DS1621
  */
void DS1621_Init(void) 
{
    // Send Access Config command
    I2C1->CR1 |= I2C_CR1_START; 
    while (!(I2C1->SR1 & I2C_SR1_SB));  
    I2C1->DR = DS1621_WRITE_ADDR;  
    while (!(I2C1->SR1 & I2C_SR1_ADDR)); 
    (void)I2C1->SR1;  
    (void)I2C1->SR2;

    while (!(I2C1->SR1 & I2C_SR1_TXE));  
    I2C1->DR = DS1621_ACCESS_CONFIG; 
    
    while (!(I2C1->SR1 & I2C_SR1_TXE));  
    I2C1->DR = 0x00;  // Set continuous conversion mode

    I2C1->CR1 |= I2C_CR1_STOP;
    while(I2C1->CR1 & I2C_CR1_STOP);
    
    delay_ms(10);
    
    // Start conversion
    Start_DS1621_Conv();
}

/**
  *   Envoi d'une commande I2C au DS1621
  */
void I2C_COMMAND(int command)
{
    I2C1->CR1 |= I2C_CR1_START; 
    while (!(I2C1->SR1 & I2C_SR1_SB));  
    I2C1->DR = DS1621_WRITE_ADDR;  
    while (!(I2C1->SR1 & I2C_SR1_ADDR)); 
    (void)I2C1->SR1;
    (void)I2C1->SR2;

    while (!(I2C1->SR1 & I2C_SR1_TXE));  
    I2C1->DR = command; 

    I2C1->CR1 |= I2C_CR1_STOP;
    while(I2C1->CR1 & I2C_CR1_STOP);
}

/**
  *   D�marrage de la conversion DS1621
  */
void Start_DS1621_Conv(void) 
{
    I2C_COMMAND(DS1621_START_CONVERSION); 
    delay_ms(10);
}

/*
  *  Lecture de la temp�rature du DS1621
  *  Temp�rature en �C
 */
float I2C_ReadTemperature(void) 
{
    int Msb, Lsb;
    float Temp;

    I2C_COMMAND(DS1621_READ_TEMP);  
    delay_ms(5);
    
    I2C1->CR1 |= I2C_CR1_START;  
    while (!(I2C1->SR1 & I2C_SR1_SB));  

    I2C1->DR = DS1621_READ_ADDR;  
    while (!(I2C1->SR1 & I2C_SR1_ADDR));  
    (void)I2C1->SR1;  
    (void)I2C1->SR2;

    I2C1->CR1 |= I2C_CR1_ACK; 
    while (!(I2C1->SR1 & I2C_SR1_RXNE));  
    Msb = I2C1->DR;  

    I2C1->CR1 &= ~I2C_CR1_ACK; 
    I2C1->CR1 |= I2C_CR1_STOP;
    while (!(I2C1->SR1 & I2C_SR1_RXNE));  
    Lsb = I2C1->DR; 

    if (Msb & 0x80) {  // Negative temperature
        Temp = Msb - 256;
    } else {            // Positive temperature
        Temp = Msb;
    }
    
    // Add 0.5 degrees if bit 7 of LSB is set
    if (Lsb & 0x80) {
        Temp += 0.5;
    }
    
    while(I2C1->CR1 & I2C_CR1_STOP);
    
    return Temp;
}

/* ========== CAN Functions ========== */

/*
  *   Envoi de la temp�rature via CAN
*/
void CAN_Send_Temperature(float temp)
{
    CanTxMsg TxMessage;
    uint8_t mailbox;
    int16_t temp_fixed;
    char debug_str[50];
    
    /* Pr�paration du message CAN */
    TxMessage.StdId = CAN_ID_TEMP_RESPONSE;
    TxMessage.ExtId = 0; // No extended ID
    TxMessage.IDE = CAN_Id_Standard; // Use standard ID
    TxMessage.RTR = CAN_RTR_Data; // Data frame
    TxMessage.DLC = 3;
    
    /* Conversion temp�rature en format fixe (x10 pour 1 d�cimale) */
    temp_fixed = (uint8_t)(temp * 10);
    
    /* Remplissage des donn�es */
    TxMessage.Data[0] = CAN_ID_TEMP_RESPONSE ; 
    TxMessage.Data[1] = (temp_fixed >> 8)& 0xFF;   // MSB
	  TxMessage.Data[2] = (temp_fixed & 0xFF); // LSB;
	  //TxMessage.Data[3] = 0;

    /* Transmission */
    mailbox = CAN_Transmit(CAN1, &TxMessage); // Transmit the CAN message
    
    /* Attendre la fin de transmission */
    uint32_t timeout = 100000;
    while(CAN_TransmitStatus(CAN1, mailbox) == CAN_TxStatus_Pending && timeout > 0)
    {
        timeout--;
    }
    
    if(CAN_TransmitStatus(CAN1, mailbox) == CAN_TxStatus_Ok)
    {
        /* Toggle LED verte = transmission OK */
        GPIOD->ODR ^= (1 << 12);
        
        /* Debug UART */
        sprintf(debug_str, "CAN TX: %.1f C \r\n", temp);
        USART3_send_string(debug_str);
    }
    else
    {
        /* Allumer LED orange = erreur transmission */
        GPIOD->ODR |= (1 << 13);
        USART3_send_string("CAN TX Failed!\r\n");
    }
}


/* ========== Main Function ========== */

/*
  Programme principal
*/
int main(void)
{
    char temp_str[50];
    
    /* Initialisation horloge HSE 8MHz */
  
    SystemClock_Config();
    /* Configuration GPIO */
    GPIO_Config();
    
    /* Initialisation I2C1 */
    config_I2C1();
    
    /* Initialisation USART2 pour debug */
    USART3_init();
    USART3_send_string("\r\n=== System Starting ===\r\n");
    
    /* Initialisation DS1621 */
    USART3_send_string("Initializing DS1621...\r\n");
    DS1621_Init();
    USART3_send_string("DS1621 OK\r\n");
    
    /* Attendre premi�re conversion (750ms) */
    delay_ms(800);
    
    /* Initialisation CAN1 */
    USART3_send_string("Initializing CAN1...\r\n");
    CAN_Config();
    USART3_send_string("CAN1 OK\r\n");
    
    /* Activation interruptions globales */
    __enable_irq();
    
    USART3_send_string("=== System Ready ===\r\n");
    
    /* Boucle principale */
    while(1) 
    {
			
  if((CAN1->RF0R & CAN_RF0R_FMP0) != 0)
    {
    uint32_t id = (CAN1->sFIFOMailBox[0].RIR >> 21) & 0x7FF;
    uint8_t dlc = CAN1->sFIFOMailBox[0].RDTR & 0x0F;
    
    char msg[50];
    sprintf(msg, "Direct read - ID: 0x%03X\r\n", (unsigned int)id);
    USART3_send_string(msg);
    
    /* Lib�rer le FIFO manuellement */
    CAN1->RF0R |= CAN_RF0R_RFOM0;
    
    /* Traiter si c'est 0x550 */
    if(id == CAN_ID_TEMP_REQUEST) {
        current_temperature = I2C_ReadTemperature();
        CAN_Send_Temperature(current_temperature);
    }
}
        
    }
}